# Brewfile
cask_args appdir: "/Applications"

tap "argon/mas"
tap "codeclimate/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jawshooah/nodenv"
tap "rcmdnk/file"
tap "sanemat/font"
tap "stripe/stripe-cli"

brew "ack"
brew "gdbm"
brew "libyaml"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "sqlite"
brew "xz"
brew "ansible"
brew "autoconf"
brew "automake"
brew "awscli"
brew "coreutils"
brew "gnu-sed"
brew "libevent"
brew "libpng"
brew "popt"
brew "s-lang"
brew "newt"
brew "freetype"
brew "fontconfig"
brew "libffi"
brew "pcre"
brew "python@3.8", link: false
brew "glib"
brew "pixman"
brew "cairo"
brew "circleci"
brew "csvkit"
brew "curl"
brew "zeromq"
brew "czmq"
brew "direnv"
brew "docker", link: false
brew "docker-machine", link: false
brew "fdk-aac"
brew "libogg"
brew "fribidi"
brew "giflib"
brew "libtool"
brew "libunistring"
brew "pkg-config"
brew "libidn2"
brew "gobject-introspection"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "jpeg"
brew "lame"
brew "libtiff"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "libass"
brew "libvorbis"
brew "opus"
brew "libvpx"
brew "sdl2"
brew "snappy"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "libspiro"
brew "libuninameslist"
brew "pango"
brew "fontforge"
brew "pcre2"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "graphviz"
brew "helm", link: false
brew "hugo"
brew "libomp"
brew "imagemagick"
brew "imagemagick@6"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "kubectx"
brew "libgpg-error"
brew "libassuan"
brew "pinentry"
brew "lastpass-cli"
brew "libsodium"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "lua"
brew "luajit"
brew "memcached"
brew "mercurial"
brew "msgpack"
brew "mysql-client"
brew "mysql@5.6"
brew "mysql@5.7"
brew "nasm"
brew "neovim"
brew "nginx"
brew "nkf"
brew "node"
brew "nodebrew"
brew "packer"
brew "perl"
brew "postgresql"
brew "pup"
brew "putty"
brew "python@2", link: false
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rsyslog"
brew "ruby"
brew "s3cmd"
brew "stern"
brew "telnet"
brew "texi2html"
brew "trash"
brew "tree"
brew "v8@3.15"
brew "vim"
brew "wget"
brew "yarn"
brew "argon/mas/mas"
brew "heroku/brew/heroku-node"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "appcleaner"
cask "clipy"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "hyperswitch"
cask "iterm2"
cask "kindle"
cask "macvim"
cask "ngrok"
cask "slack"
cask "vagrant"
cask "virtualbox"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
